In [1]:
import pandas.io.data as web
from pandas import DataFrame, Series

/Users/ziru.fan/anaconda2/lib/python2.7/site-packages/pandas/io/data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [2]:
all_data = {}

In [3]:
for ticker in ['AAPL', 'IBM', 'MSFT', 'HP']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')

In [4]:
type(all_data)

dict

In [5]:
type(all_data['AAPL'])

pandas.core.frame.DataFrame

In [6]:
all_data['AAPL'][:5]

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2000-01-03,104.874997,112.499998,101.687501,111.937502,133949200,3.679885
2000-01-04,108.250001,110.625002,101.187503,102.500003,128094400,3.369633
2000-01-05,103.749998,110.562497,103.000001,103.999997,194580400,3.418944
2000-01-06,106.124999,106.999999,94.999998,94.999998,191993200,3.123074
2000-01-07,96.499999,101.000002,95.500003,99.500001,115183600,3.271009

In [7]:
price = DataFrame({tic:data['Adj Close'] for tic,data in all_data.iteritems()})

In [8]:
price.head()

                AAPL        HP        IBM       MSFT
Date
2000-01-03  3.679885  6.114849  90.028414  40.088751
2000-01-04  3.369633  5.929551  86.972492  38.734546
2000-01-05  3.418944  5.929551  90.028414  39.142957
2000-01-06  3.123074  6.281618  88.476200  37.831743
2000-01-07  3.271009  6.429856  88.088146  38.326135

In [9]:
price.tail()

                 AAPL         HP         IBM       MSFT
Date
2009-12-24  27.488311  37.125447  112.660978  26.087508
2009-12-28  27.826260  36.976277  114.162311  26.230569
2009-12-29  27.496202  36.353279  113.765412  26.415706
2009-12-30  27.830205  35.730282  114.386657  26.053846
2009-12-31  27.710543  34.993213  112.945704  25.649911

In [10]:
volumn = DataFrame({tic:data['Volume'] for tic,data in all_data.iteritems()})

In [11]:
volumn[:5]

                 AAPL       HP       IBM      MSFT
Date
2000-01-03  133949200  1145000  10347700  53228400
2000-01-04  128094400  1927200   8227800  54119000
2000-01-05  194580400  1285600  12733200  64059600
2000-01-06  191993200   577000   7971900  54976600
2000-01-07  115183600   563800  11856700  62013600

In [12]:
returns = price.pct_change()

In [13]:
returns[:5]

                AAPL        HP       IBM      MSFT
Date
2000-01-03       NaN       NaN       NaN       NaN
2000-01-04 -0.084310 -0.030303 -0.033944 -0.033780
2000-01-05  0.014634  0.000000  0.035137  0.010544
2000-01-06 -0.086538  0.059375 -0.017241 -0.033498
2000-01-07  0.047368  0.023599 -0.004386  0.013068

In [14]:
returns.MSFT.corr(returns.IBM)

0.49597968454928898

In [15]:
returns.MSFT.cov(returns.IBM)

0.00021595764843398285

In [16]:
returns.corr()

          AAPL        HP       IBM      MSFT
AAPL  1.000000  0.206232  0.410011  0.424305
HP    0.206232  1.000000  0.261324  0.260339
IBM   0.410011  0.261324  1.000000  0.495980
MSFT  0.424305  0.260339  0.495980  1.000000

In [17]:
returns.cov()

          AAPL        HP       IBM      MSFT
AAPL  0.001027  0.000195  0.000252  0.000309
HP    0.000195  0.000866  0.000147  0.000174
IBM   0.000252  0.000147  0.000367  0.000216
MSFT  0.000309  0.000174  0.000216  0.000516